[
    {
        "date": "2026-02-03",
        "text": "I had a really horrible nightmare of becoming a completely failured person. So shameful that I woke up crying and dare not to log it properly."
    },
    {
        "date": "2026-02-02",
        "text": "I dreamed of playing game with friends, but it's so laggy. And there were stray cats under the raised floor of the house. There was a relative living in the same neibourhood and they gave me some vegetables.I also dreamed of somewhere like the classrooms from my elementary, and something about web design?"
    },
    {
        "date": "2026-02-01",
        "text": "I dreamed of one of my favorite splatoon pro players, he's got a list full of fans' names and favorite colors."
    },
    {
        "date": "2026-01-31",
        "text": "I dreamed of driving home with my uncle, parents, cousin(my sister) ,my sister's friend and two other people, maybe grandpa too. It was uncle who was driving. We went to the clothes store. During the drive, the two other people in the car were arguing about something. Finally, we arrived at home, and grandma was there, I gave my mom's glasses to grandma. Then me and my father, uncle, mom and sister were driving to leave again. However, one of the two other people suddenly chasesd after to ask, nearly beg, to give them a ride. This person is pretty vague, but I feel like it was my ex."
    },
    {
        "date": "2026-01-30",
        "text": "I dreamed of someone resembles my elementary classmate, we had a shooting contest in game."
    },
    {
        "date": "2026-01-28",
        "text": "At first, it was in a school setting, but it was winding like a maze. And you have to reach a end point. There was a poster of LeBron James. Then I dreamed of road hiking which I possibly had always heared of when I was a kid. There were a person with yellow short hair walking with another person who has white long hair. Occationally, I dreamed of garbages on the roadside. The white haired person was waving hands, but I thought they have stolen the ghost's spider, because the way they waving hands looked like a spider. The yellow haired person seemed a bit shy. "
    },

    {
        "date": "2026-01-26",
        "text": "I dreamed of playing Salmon Run, and I was using grizzco slosher, but my teammates were unable to cooperate well. I had to run around the map to clear the salmonids alone. Then I dreamed of playing a event match in collaboration with a band, but it was actually just paint the turfs in a supermarket. Somehow I went to the bathroom, someone opened the door and asked what did I want, but I was in a hurry and anxious, so I directly shut the door without answering. The bathroom was kind of dirty. I can't remember if I managed to take a dump or not."
    },
    {
        "date": "202-01-24",
        "text": "A dream full of chaotic school scenes. I possibly dreamed of a classmate from my high school, who I thought was cute and had dreamed of her several times before, with her boyfriend? Then I wore a sub-culture outfit designed by a short hair student who looked like a typical student from China's Academy of Art, I have no idea how we knew each other. The clothes was light pink and oversized, covering the butt. She said it looks nice. Maybe she was referring to that unfashinable, old-school style. She also brought me blue jeans, and persuaded me to join some event with her. There were all fashinable people like her. I kept trying hard to think if there were any hairdressing schools nearby, so I can pretend I was a student of here."
    },
    {
        "date": "2026-01-22",
        "text": "I dreamed about many stuffs. First was the things I was thinking before sleeping. Then there was some place like theme park. And it got vulgar but funny. Like, the genitals of a cactus is also a cactus. I remember clearly, we were in something like tour bus, the cactus was like an animal in nature reserve, running in the distance. Suddenly someone yelled 'Look! The small cactus is gonna falling off!' But it just drooped down. It was the genitals of cactus, the color was very specific: the grey from yellow (or blue?) added skin's green. I was chased by it later, but I ran into ice or fire themed area, according to pokemon type chart. Subsequently, I dreamed of a friendly person, who took me to go through some formalities, I saw bunch of work permission stuffs, seemed like students from South Africa, Laos and Vietnam can legally work with this. Also I was in a noisy residental area, looked like the community of Chinatown in foreign countries."
    },
    {
        "date": "2026-02-03",
        "text": "One of the few times I dreamed about something felt more like university life. I was learning a lot of courses to catch up and even taking courses I have already passed in order to improve my grades. But otherwise it felt more like high school. It was probably the first time I would emphathized with 'bad student'. I felt jealous when the teacher said, 'why is your handwriting so ugly and sloppy, while XX's handwriting is so beautiful and never messy?' The teacher even got angry over a student who bought a craft kit. I don't know why, but I felt ashamed about it."
    }
]